Tekla.Structures.Solid.FaceEnumerator.#ctor(System.Collections.IEnumerator,System.Collections.IEnumerator)
Instantiates a new face enumerator. This constructor should
only be called by someone inheriting from ISolid.
Enumerator: The father solid's face list enumerator.
VectorEnumerator: The father solid's face normal vector enumerator.